{
  "testimonials": [
    {
      "name": "Alex McKenzie",
      "class": "LCL '19",
      "message": "You can find all the startup information you want online, but LCL's real value-add comes from being able to tap experienced people for their knowledge-base in order to apply those broad principles to your specific scenario. Even though the entrepreneurial scene is largely self-directed, there is so much to be gained from having someone show you the ropes, and the specific skills LCL promotes are immediately applicable in your day-to-day (e.g. pitching, presenting, customer discovery). My venture has developed from what I thought was a fully fleshed out idea to an actually marketable product, my interns have been extremely helpful, and the LCL community is filled with sources of inspiration to pull from - 11/10 would recommend."
    },
    {
      "name": "Iliana Paleva & Clare McLeod",
      "class": "LCL '19",
      "message": "LCL has helped me tremendously in thinking about what problem my company is actually striving to solve and how to best solve it. I’ve had access to mentors, inspiring speakers from all parts of the entrepreneurial world, and an incredible team of hardworking undergrads. I’ve laughed, almost cried, and become a whole heck of a lot more comfortable public speaking. I would truly not feel as confident as I do now in myself and in my venture if not for LCL. It’s been a wonderful community.",
      "headshots": [
        {
          "headshot": "/img/uploads/iliana.jpg"
        },
        {
          "headshot": "/img/uploads/clare.jpg"
        }
      ]
    },
    {
      "name": "Aadi Kulkarni & Henry Manley",
      "class": "LCL '20",
      "message": "LCL was more than just a program for our business. It was a community. A place to laugh and to learn. A place to listen and to share ideas. Despite the challenging worldly circumstances, the LCL team delivered on such a unique and productive summer. From customer discovery to distribution strategy, our mentors Pam Silverstein and Amber Harris helped us think creatively and meet new faces in industry. It was such a blessing to get texts from Pam especially with updates on her front or news she had received that would help the POLICI team. She was truly on our team. Timmy's value in empathy also resonated with us, helping us better understand the needs of our customers and helping us humble ourselves in product development. In all, the LCL community is full of sharp minds and caring people that go beyond your business to help you and your team."
    },
    {
      "name": "Mei Johnson",
      "class": "LCL '20",
      "message": "I just wanted to take a second to thank all of you for running such a great accelerator program this summer! I know that COVID-19 made it difficult for really any summer program to go on, so it meant a lot to me that LCL \"hung in there\" and held its accelerator program anyway. Your persistence is really admirable, and it was amazing that you all managed to foster such a warm, caring environment, even though we were communicating through screens. I definitely learned a lot, but what really stuck with me the whole time is how welcoming everyone was. I was worried initially that I'd stick out too much and be isolated or left behind, but everyone was so kind and friendly that I truly felt at home. I wish you all the best, and I hope you stay happy and healthy in these trying times."
    },
    {
      "name": "Hayoung Ryu",
      "class": "LCL '19",
      "message": "LCL accelerator allowed me to be provided with the resources to build our ideas and be connected to many entrepreneurs and other people that we found to be very helpful on the way to troubleshooting and building our company. With the help of LCL, we are currently at the stage where our first prototype is built and where we are conducting customer discoveries and forming partnerships."
    },
    {
      "name": "Jordyn Goldzweig & Sam Brickman",
      "class": "LCL '19 & LCL '20",
      "message": "We went through the LCL summer accelerator with our company, Quarantine Buddy, a website that matches and introduces people together as well as hosts virtual events to help people build meaningful friendships. Through the amazing mentorship and speaker program, LCL allowed our company to grow and prosper this summer. This summer, we were featured on Live with Kelly and Ryan, CBS This Morning, TIME Magazine, and mentioned in one of Governor Cuomo's briefings, allowing us to expand to over 130 countries. We have accumulated thousands of users and have made over 100,000 matches. The LCL programming gave us access to weekly speakers and allowed us to get valuable advice that drove a lot of our decisions. The mentorship that LCL provided also drove most of our success this summer, and we really could not have done it without the program. Myself and my co-founder really owe a large amount of our success to the program, and hope to give back any way that we can in the future. We are so fortunate and thankful for being able to participate in this program, and we would not be where we are today without it."
    },
    {
      "name": "Waishan Qiu",
      "class": "LCL '20",
      "message": "LCL Summer Accelerator did a great job! As a startup participant, we got more than we expected, e.g. the very good mentorship for early-stage companies, many experienced pitch judges to push your pitch skills, great connections to Cornell entrepreneurship community, abundant resources to recruit brilliant summer interns, access to StartupTree and eLab, plus very insightful guest speakers every week. I strongly recommend early-stage companies and students to apply. Thank you for everything again, Timmy, Pam, Jojo, Irena, Peter, and all the amazing people."
    },
    {
      "name": "Eshan Dalela & Patrick Han",
      "class": "LCL '20",
      "message": "LCL has been nothing but amazing for the team. It really helped us figure out a lot of core problems we were initially having during our early stages. Pam, Timmy, and the LCL team at large were not only great mentors for our company, but also for our personal growth and development. The best thing about LCL is that it is a community that expands way beyond the 8-week program and I am so glad our team members can be part of this community for life."
    }
  ]
}